In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01  2.680184 -0.665666 -1.070400 -0.763397
2013-01-02 -1.478059  0.453339 -1.218594  1.572758
2013-01-03  0.205837 -0.054948  0.800283 -0.710680
2013-01-04  0.257498 -1.765402  1.643946  1.287131
2013-01-05  2.640410 -0.862904  0.706138  0.032289
2013-01-06  0.078670 -0.111575 -0.190984  0.137175

In [9]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.to_numpy()

array([[ 2.68018412, -0.66566622, -1.07040028, -0.76339708],
       [-1.47805905,  0.45333925, -1.21859399,  1.57275844],
       [ 0.20583679, -0.05494813,  0.80028291, -0.71068049],
       [ 0.25749846, -1.76540171,  1.6439458 ,  1.2871309 ],
       [ 2.64041045, -0.86290423,  0.70613779,  0.03228885],
       [ 0.07866982, -0.11157523, -0.19098375,  0.13717505]])

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.680184   -1.478059    0.205837    0.257498    2.640410    0.078670
B   -0.665666    0.453339   -0.054948   -1.765402   -0.862904   -0.111575
C   -1.070400   -1.218594    0.800283    1.643946    0.706138   -0.190984
D   -0.763397    1.572758   -0.710680    1.287131    0.032289    0.137175

In [22]:
df

                   A         B         C         D
2013-01-01  2.680184 -0.665666 -1.070400 -0.763397
2013-01-02 -1.478059  0.453339 -1.218594  1.572758
2013-01-03  0.205837 -0.054948  0.800283 -0.710680
2013-01-04  0.257498 -1.765402  1.643946  1.287131
2013-01-05  2.640410 -0.862904  0.706138  0.032289
2013-01-06  0.078670 -0.111575 -0.190984  0.137175

In [33]:
# axis =0 means rows, axis =1  == columns
#df.sort_index(axis =1, ascending=False)
df.sort_index(axis =0, ascending=True)

                   A         B         C         D
2013-01-01  2.680184 -0.665666 -1.070400 -0.763397
2013-01-02 -1.478059  0.453339 -1.218594  1.572758
2013-01-03  0.205837 -0.054948  0.800283 -0.710680
2013-01-04  0.257498 -1.765402  1.643946  1.287131
2013-01-05  2.640410 -0.862904  0.706138  0.032289
2013-01-06  0.078670 -0.111575 -0.190984  0.137175

In [39]:
df.sort_values(by="A")

                   A         B         C         D
2013-01-02 -1.478059  0.453339 -1.218594  1.572758
2013-01-06  0.078670 -0.111575 -0.190984  0.137175
2013-01-03  0.205837 -0.054948  0.800283 -0.710680
2013-01-04  0.257498 -1.765402  1.643946  1.287131
2013-01-05  2.640410 -0.862904  0.706138  0.032289
2013-01-01  2.680184 -0.665666 -1.070400 -0.763397

In [42]:
df[["A","B"]]

                   A         B
2013-01-01  2.680184 -0.665666
2013-01-02 -1.478059  0.453339
2013-01-03  0.205837 -0.054948
2013-01-04  0.257498 -1.765402
2013-01-05  2.640410 -0.862904
2013-01-06  0.078670 -0.111575

In [46]:
df.loc[:,["A", "B"]]

                   A         B
2013-01-01  2.680184 -0.665666
2013-01-02 -1.478059  0.453339
2013-01-03  0.205837 -0.054948
2013-01-04  0.257498 -1.765402
2013-01-05  2.640410 -0.862904
2013-01-06  0.078670 -0.111575

In [47]:
df.iloc[0:4,0:2]  # index ko loc krna

                   A         B
2013-01-01  2.680184 -0.665666
2013-01-02 -1.478059  0.453339
2013-01-03  0.205837 -0.054948
2013-01-04  0.257498 -1.765402

In [48]:
df.iloc[3]  #only gives value at index 3

A    0.257498
B   -1.765402
C    1.643946
D    1.287131
Name: 2013-01-04 00:00:00, dtype: float64